In [1]:
import pandas as pd

In [2]:
# 1. Load Datasets

In [5]:
# student (dictionary)
student = {
    "StudentID" : [101, 102, 103, 104],
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Marks" : [85, 90, 88, 92]
}

In [56]:
# Load students into pandas DataFrames.
df1 = pd.DataFrame(student)

In [58]:
# display df1
df1

   StudentID     Name  Marks
0        101    Alice     85
1        102      Bob     90
2        103  Charlie     88
3        104    David     92

In [11]:
# details (dictionary) 
details = {
    "StudentID" : [101, 102, 103, 105],
    "Age" : [20, 21, 22, 19],
    "Grade" : ["A", "B", "A", "C"]
}

In [13]:
# Load details.csv into pandas DataFrames.
df2 = pd.DataFrame(details)

In [15]:
# display df2
df2

   StudentID  Age Grade
0        101   20     A
1        102   21     B
2        103   22     A
3        105   19     C

In [17]:
# 2. Performing joins

In [19]:
# inner join
#inner join
merged_df_inner = pd.merge(df1,df2,on='StudentID', how='inner')

In [44]:
# display merged_df_inner
merged_df_inner


# Inner Join (Matching records in both datasets):
#      --> Only students present in both df1 and df2 are included.
#      --> Excluded: Student 104 (only in df1) and Student 105 (only in df2).

   StudentID     Name  Marks  Age Grade
0        101    Alice     85   20     A
1        102      Bob     90   21     B
2        103  Charlie     88   22     A

In [46]:
# left join
merged_df_left = pd.merge(df1, df2, on='StudentID', how='left')

In [52]:
# display merged_df_left
merged_df_left

# Left Join (All students from df1, matching details if available):
#      --> Keeps all records from df1 and adds matching df2 data.
#      --> Excluded: Student 105 (only in df2).
#      --> Missing values (NaN) for Student 104 (who has no matching details)

   StudentID     Name  Marks   Age Grade
0        101    Alice     85  20.0     A
1        102      Bob     90  21.0     B
2        103  Charlie     88  22.0     A
3        104    David     92   NaN   NaN

In [48]:
# right join
merged_df_right = pd.merge(df1, df2, on='StudentID', how='right')

In [50]:
# display merged_df_right
merged_df_right

#Right Join (All students from df2, matching marks if available):
#    -->Keeps all records from df2 and adds matching df1 data.
#    -->Excluded: Student 104 (only in df1).
#    -->Missing values (NaN) for Student 105 (who has no marks data).

   StudentID     Name  Marks  Age Grade
0        101    Alice   85.0   20     A
1        102      Bob   90.0   21     B
2        103  Charlie   88.0   22     A
3        105      NaN    NaN   19     C

In [32]:
# outer join
merged_df_outer = pd.merge(df1, df2, on='StudentID', how='outer')

In [36]:
# display merged_df_outer
merged_df_outer

#Outer Join (All students from both datasets):
#    -->Includes all students, whether they are in students.csv or details.csv.
#    -->Missing values (NaN) for Student 104 (no details) and Student 105 (no marks)

   StudentID     Name  Marks   Age Grade
0        101    Alice   85.0  20.0     A
1        102      Bob   90.0  21.0     B
2        103  Charlie   88.0  22.0     A
3        104    David   92.0   NaN   NaN
4        105      NaN    NaN  19.0     C

In [60]:
# 3. Set index

In [68]:
# Set StudentID as the index for the merged DataFrame.
outer_join_indexed = merged_df_outer.set_index("StudentID")

In [72]:
# display outer_join_indexed
outer_join_indexed

              Name  Marks   Age Grade
StudentID
101          Alice   85.0  20.0     A
102            Bob   90.0  21.0     B
103        Charlie   88.0  22.0     A
104          David   92.0   NaN   NaN
105            NaN    NaN  19.0     C

In [80]:
#Reset the index back to default.
outer_join_reindexed = outer_join_indexed.reset_index()

In [84]:
# display outer_join_reindexed
outer_join_reindexed

   StudentID     Name  Marks   Age Grade
0        101    Alice   85.0  20.0     A
1        102      Bob   90.0  21.0     B
2        103  Charlie   88.0  22.0     A
3        104    David   92.0   NaN   NaN
4        105      NaN    NaN  19.0     C

In [87]:
# 4. Save the Results

In [93]:
#Save the result of the outer join (merged_df_outer) to a new CSV file called merged_students_details.csv.
merged_df_outer.to_csv("merged_students_details.csv", index=False)